tap "antoniorodr/memo"
tap "steipete/tap"
brew "bat"
brew "cmake"
brew "code-server"
brew "convmv"
brew "coreutils"
brew "deno"
brew "eza"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gogcli"
brew "jq"
brew "lazygit"
brew "llama.cpp"
brew "ninja"
brew "nvm"
brew "ripgrep"
brew "opencode"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "pyenv"
brew "tldr"
brew "tmux"
brew "ttyd"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "antoniorodr/memo/memo"
brew "steipete/tap/remindctl"
brew "direnv"
cask "font-meslo-lg-nerd-font"
cask "raycast"
cask "tailscale-app"
cask "visual-studio-code"
vscode "alphabotsec.vscode-eclipse-keybindings"
vscode "andrepimenta.claude-code-chat"
vscode "anthropic.claude-code"
vscode "batisteo.vscode-django"
vscode "compulim.vscode-ipaddress"
vscode "continue.continue"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "google.geminicodeassist"
vscode "kevinrose.vsc-python-indent"
vscode "linjun.dbeaver-support"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "printfn.gemini-improved"
vscode "ritwickdey.liveserver"
vscode "wholroyd.jinja"
uv "nano-pdf"
