brew "atuin"
brew "bat"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "gh"
brew "git"
brew "git-delta"
brew "gogcli"
brew "hyperfine"
brew "jq"
brew "just"
brew "lazygit"
brew "llama.cpp"
brew "mise"
brew "ninja"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "ripgrep"
brew "tailscale"
brew "tmux"
brew "watchexec"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
cask "font-meslo-lg-nerd-font"
cask "raycast"
cask "tailscale-app"
cask "visual-studio-code"
# Keep the base VS Code install minimal and broadly useful.
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
uv "nano-pdf"
